Revit 2027 API
BuiltInFailures.SketchFailures.InvalidElevationSketch Property
 Elevation Profile sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidElevationSketch { get; }
Public Shared ReadOnly Property InvalidElevationSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidElevationSketch {
	FailureDefinitionId^ get ();
}
static member InvalidElevationSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace